Revit 2026 API

# ComboBoxCurrent Property

---

Gets or sets the current checked ComboBox member of the ComboBox.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ComboBoxMember Current { get; set; }
```
```vb
Public Property Current As ComboBoxMember
	Get
	Set
```
```cpp
public:
property ComboBoxMember^ Current {
	ComboBoxMember^ get ();
	void set (ComboBoxMember^ value);
}
```
```fsharp
member Current : ComboBoxMember with get, set
```

#### Property Value

ComboBoxMember

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when trying to set this property to . |
| ArgumentException | Thrown when trying to set this property to a button not in this ComboBox. |

The default value is the first ComboBox member added to the ComboBox.

#### Reference

ComboBox Class

Autodesk.Revit.UI Namespace